app/Models/BookingModel.php

SELECT `b`.*, `u`.`full_name`, `u`.`Email`
FROM `booking_tbl` `b`
LEFT JOIN `user_tbl` `u` ON `b`.`user_id` = `u`.`user_Id`
WHERE `b`.`user_id` IS NULL
ORDER BY `b`.`booking_date` DESC
---
    public function getAllBookingsForCalendar()
    {
        $builder = $this->db->table('booking_tbl b');
        $builder->select('b.booking_date, b.start_time, b.end_time, b.reason, b.extra_info, u.full_name');
        $builder->join('user_tbl u', 'b.user_id = u.user_Id', 'left');
        $builder->where('b.booking_date >=', date('Y-m-d')); // Only current and future dates
        $builder->orderBy('b.booking_date', 'ASC');
        $builder->orderBy('b.start_time', 'ASC');

        return $builder->get()->getResultArray();